In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('employees.csv')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [9]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [10]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services

In [18]:
df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])

In [ ]:
df.drop(df.columns[-1], axis=1, inplace=True)

In [22]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2023-04-11 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2023-04-11 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2023-04-11 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2023-04-11 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2023-04-11 16:47:00,101004,1.389,True,Client Services

In [24]:
df['Senior Management'] = df['Senior Management'].astype('bool')

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.8+ KB

In [29]:
df['Gender'] = df['Gender'].astype('category')

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB

In [36]:
df = pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2023-04-11 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2023-04-11 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2023-04-11 11:17:00,130590,11.858,False,Finance

In [46]:
df[df['Team'] == 'Finance'];

In [43]:
mask1 = df['Gender'] == 'Male'

mask2 = df['Team'] == 'Marketing'

df[mask1 & mask2];

In [44]:
mask = df['Team'].isin(['Legal', 'Sales', 'Product'])
df[mask];

In [45]:
condition = df['Gender'].notnull()

df[condition];

In [47]:
df = pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.sort_values('First Name', inplace= True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2023-04-11 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2023-04-11 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2023-04-11 14:53:00,52119,11.343,True,Client Services

In [50]:
df['First Name'].duplicated()

101    False
327     True
440     True
937     True
137    False
       ...
902     True
925     True
946     True
947     True
951     True
Name: First Name, Length: 1000, dtype: bool

In [ ]:
df.drop_duplicates()